---
type: SpatialElement
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# SpatialElement

`Autodesk.Revit.DB.SpatialElement` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetBoundarySegments | 2012 | `public IList < IList < BoundarySegment >> GetBoundarySegments ( SpatialElementBoundaryOptions options )` |
| Method | GetSpatialElementDomainData | 2023 | `public SpatialElementDomainData GetSpatialElementDomainData ()` |
| Property | Area | — | `public double Area { get ; }` |
| Property | Level | — | `public Level Level { get ; }` |
| Property | Location | — | `public override Location Location { get ; }` |
| Property | Name | — | `public override string Name { set ; }` |
| Property | Number | — | `public string Number { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Perimeter | — | `public double Perimeter { get ; }` |
| Property | SpatialElementType | 2023 | `public SpatialElementType SpatialElementType { get ; }` |